# Pandas Series
## Think of series like a single column in a excel sheet

In [1]:
import numpy as np
import pandas as pd

In [2]:
mydays = ["Sun", "Mon", "Tue"]
myexp = [34, 44, 29]

In [3]:
type(myexp)

list

In [4]:
# can pass a list directly to series
a_mydays = np.array(mydays)
a_myexp = np.array(myexp)
a_mydays

array(['Sun', 'Mon', 'Tue'], dtype='<U3')

In [5]:
pd.Series(a_mydays)

0    Sun
1    Mon
2    Tue
dtype: object

In [6]:
pd.Series(myexp)

0    34
1    44
2    29
dtype: int64

In [7]:
s_myexp = pd.Series(data=myexp, index=mydays)
s_myexp

Sun    34
Mon    44
Tue    29
dtype: int64

In [8]:
s_myexp[0]

34

In [9]:
s_myexp["Sun"]

34

# Pandas Dataframes
## A dataframe is like an entire excel sheet

In [10]:
mynums = np.arange(1,10).reshape(3, 3)
mynums

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [11]:
df = pd.DataFrame(mynums, columns=["Col1", "Col2", "Col3"], index=["Row1", "Row2", "Row3"])
df

      Col1  Col2  Col3
Row1     1     2     3
Row2     4     5     6
Row3     7     8     9

In [12]:
df.loc["Row1","Col1"]

1

# DataFrames from CSV's

In [14]:
imported_df = pd.read_csv("./Piece_Dim.csv", index_col="Item_No")

In [15]:
imported_df.head()

         Length  Width  Height Operator
Item_No
Item-1   102.67  49.53   19.69     Op-1
Item-2   102.50  51.42   19.63     Op-1
Item-3    95.37  52.25   21.51     Op-1
Item-4    94.77  49.24   18.60     Op-1
Item-5   104.26  47.90   19.46     Op-1

In [16]:
imported_df.tail()

         Length  Width  Height Operator
Item_No
Item-46  101.21  47.61   21.39     Op-2
Item-47  101.09  48.28   20.04     Op-2
Item-48   95.61  46.30   20.31     Op-2
Item-49  104.45  48.71   19.51     Op-2
Item-50   93.28  48.08   19.64     Op-2

In [17]:
imported_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, Item-1 to Item-50
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Length    50 non-null     float64
 1   Width     50 non-null     float64
 2   Height    50 non-null     float64
 3   Operator  50 non-null     object
dtypes: float64(3), object(1)
memory usage: 2.0+ KB

In [18]:
imported_df.describe()

           Length      Width     Height
count   50.000000  50.000000  50.000000
mean   100.128800  49.461400  20.014000
std      5.075593   2.615639   1.074069
min     89.820000  44.460000  17.370000
25%     95.675000  48.105000  19.375000
50%     99.830000  49.315000  19.930000
75%    104.402500  50.780000  20.595000
max    110.540000  55.760000  23.110000

# Dealing With Columns

In [19]:
df = imported_df

In [21]:
df["Length"].head()

Item_No
Item-1    102.67
Item-2    102.50
Item-3     95.37
Item-4     94.77
Item-5    104.26
Name: Length, dtype: float64

In [22]:
df[["Length", "Width"]].head()

         Length  Width
Item_No
Item-1   102.67  49.53
Item-2   102.50  51.42
Item-3    95.37  52.25
Item-4    94.77  49.24
Item-5   104.26  47.90

In [25]:
df["Volume"] = np.round(df["Length"]*df["Width"]*df["Height"], 2)
df["Volume"].head()

Item_No
Item-1    100128.48
Item-2    103460.90
Item-3    107186.10
Item-4     86796.43
Item-5     97184.29
Name: Volume, dtype: float64

In [27]:
df = df.drop("Volume", axis=1)
df.head()

         Length  Width  Height Operator
Item_No
Item-1   102.67  49.53   19.69     Op-1
Item-2   102.50  51.42   19.63     Op-1
Item-3    95.37  52.25   21.51     Op-1
Item-4    94.77  49.24   18.60     Op-1
Item-5   104.26  47.90   19.46     Op-1

# Dealing With Rows

In [28]:
df.tail()

         Length  Width  Height Operator
Item_No
Item-46  101.21  47.61   21.39     Op-2
Item-47  101.09  48.28   20.04     Op-2
Item-48   95.61  46.30   20.31     Op-2
Item-49  104.45  48.71   19.51     Op-2
Item-50   93.28  48.08   19.64     Op-2

In [29]:
df.loc["Item-1"]

Length      102.67
Width        49.53
Height       19.69
Operator      Op-1
Name: Item-1, dtype: object

In [32]:
df.loc[["Item-1", "Item-2"], ["Length", "Width"]]

         Length  Width
Item_No
Item-1   102.67  49.53
Item-2   102.50  51.42

In [38]:
df.iloc[[0, 1], [0, 1]]

         Length  Width
Item_No
Item-1   102.67  49.53
Item-2   102.50  51.42

In [40]:
df.iloc[:5, [0, 1]]

         Length  Width
Item_No
Item-1   102.67  49.53
Item-2   102.50  51.42
Item-3    95.37  52.25
Item-4    94.77  49.24
Item-5   104.26  47.90

In [44]:
op1 = df[df["Operator"] == "Op-1"]
op1

         Length  Width  Height Operator
Item_No
Item-1   102.67  49.53   19.69     Op-1
Item-2   102.50  51.42   19.63     Op-1
Item-3    95.37  52.25   21.51     Op-1
Item-4    94.77  49.24   18.60     Op-1
Item-5   104.26  47.90   19.46     Op-1
Item-6   105.18  49.39   20.36     Op-1
Item-7    97.35  48.05   20.22     Op-1
Item-8    99.35  44.59   21.03     Op-1
Item-9    90.62  47.29   19.78     Op-1
Item-10   97.22  52.14   20.71     Op-1
Item-11  100.00  54.76   20.62     Op-1
Item-12   97.23  48.26   19.51     Op-1
Item-13  105.72  50.04   20.06     Op-1
Item-14   89.82  45.98   20.30     Op-1
Item-15   99.17  53.54   20.25     Op-1
Item-16   95.51  45.36   20.52     Op-1
Item-17  107.69  48.18   19.33     Op-1
Item-18  106.83  50.81   19.12     Op-1
Item-19   98.73  55.76   19.37     Op-1
Item-20   94.31  48.74   18.80     Op-1
Item-21  104.87  49.73   19.94     Op-1
Item-22   98.06  48.39   19.79     Op-1
Item-23  108.45  44.46   22.31     Op-1
Item-24   95.34  46.03   20.17     Op-1
Item-25   97.66  50.69   19.54     Op-1

In [43]:
op1.describe()

           Length      Width     Height
count   25.000000  25.000000  25.000000
mean    99.547200  49.301200  20.024800
std      5.147417   2.955796   0.823514
min     89.820000  44.460000  18.600000
25%     95.510000  47.900000  19.510000
50%     98.730000  49.240000  19.940000
75%    104.260000  50.810000  20.360000
max    108.450000  55.760000  22.310000

In [47]:
op1[(op1["Length"] > 105) & (op1["Width"] > 50)]

         Length  Width  Height Operator
Item_No
Item-13  105.72  50.04   20.06     Op-1
Item-18  106.83  50.81   19.12     Op-1

In [48]:
op1[(op1["Length"] > 107) | (op1["Width"] > 53)]

         Length  Width  Height Operator
Item_No
Item-11  100.00  54.76   20.62     Op-1
Item-15   99.17  53.54   20.25     Op-1
Item-17  107.69  48.18   19.33     Op-1
Item-19   98.73  55.76   19.37     Op-1
Item-23  108.45  44.46   22.31     Op-1